## Question 1

In [1]:
import pandas as pd

In [9]:
pd_series = pd.Series([4,8,15,16,23,42])

In [5]:
type(pd_series)

pandas.core.series.Series

In [6]:
pd_series.head()

0     4
1     8
2    15
3    16
4    23
dtype: int64

In [7]:
print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Question 2

In [28]:
a_list = ['name', 'age', '746', '90', '94', '45', 'pwskills', 'mentor', 'remotes', 'database']

In [29]:
pd_s2 = pd.Series(a_list)

In [30]:
print(pd_s2)

0        name
1         age
2         746
3          90
4          94
5          45
6    pwskills
7      mentor
8     remotes
9    database
dtype: object

In [13]:
type(pd_s2)

pandas.core.series.Series

## Question 3

In [16]:
data_dict = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df = pd.DataFrame(data_dict)

In [17]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Question 4

A data frame is a table containing columns names and rows of data. Each column is a series.

E.G.

In [18]:
# This is a dataframe

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
# This is a series
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [22]:
type(df['Name'])

pandas.core.series.Series

## Question 5

1. df.dtypes
2. df.shape
3. df.columns
4. df.isnull().sum()

In [27]:
# When your console does not output the entire column names for viewing, we can
# use the .columns to get a list of all the columns in the dataframe.

df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

## Question 6

In Series, DataFrame, Panel - data are mutable.

Only that in series due to its homogeneous nature, the size of the series is immutable.

## Question 7

In [2]:
import pandas as pd

In [3]:
#Series
name_series = pd.Series(['Sodiq', 'Olamide', 'Lawal', 'John', 'Smith'])
year_series = pd.Series([2017, 2018, 2019, 2020, 2021])
age_series = pd.Series([25, 28, 29, 30, 31])

#Dataframe
df2 = pd.DataFrame({"Name": name_series, 'Year': year_series, 'Age': age_series})

df2

      Name  Year  Age
0    Sodiq  2017   25
1  Olamide  2018   28
2    Lawal  2019   29
3     John  2020   30
4    Smith  2021   31

In [4]:
df2.loc[0]

Name    Sodiq
Year     2017
Age        25
Name: 0, dtype: object